[
  {
    "name": "Captain America",
    "realname": "Steve Rogers",
    "team": "Avengers",
    "firstappearance": "1941",
    "createdby": "Joe Simon",
    "publisher": "Marvel Comics",
    "youtubeURL": "https://www.youtube.com/watch?v=dKrVegVI0Us",
    "IMDB": "6.9/10",
    "imageurl": "https://www.simplifiedcoding.net/demos/marvel/captainamerica.jpg",
    "bio": "\r\n\t\tSteven Rogers was born in the Lower East Side of Manhattan, New York City, in 1925 to poor Irish immigrants, Sarah and Joseph Rogers. Joseph died when Steve was a child, and Sarah died of pneumonia while Steve was a teen. By early 1940, before America's entry into World War II, Rogers is a tall, scrawny fine arts student specializing in illustration and a comic book writer and artist.\r\n\t\t Envious of his friend Bucky Barnes’ military enlistment, and undeterred by his own multiple rejections by the U.S. Army, physical weakling Steve Rogers made one more attempt to join the march of men to fight for their country in the dark days of World War II. Rogers’ valiant wish to fight bullies wherever they were grabbed the attention of scientist Dr. Abraham Erskine, and he handpicked the idealistic young man for the Army’s Super-Soldier program under his supervision.\n\n Though Rogers learned of Erskine’s disastrous previous attempts to realize a super-soldier, Germany’s so-called “Red Skull,” he braved the process and emerged from it a new man. With a powerful body and heightened speed and reflexes, Rogers faced his first challenge when forced to chase down Dr. Erskine’s assassin immediately following the experiment. In doing so, he also learned of the involvement of Hydra, the Nazi science division, in the doctor’s murder.\n\n The Army moved swiftly to create a colorful, star-spangled persona for Steve Rogers they called “Captain America,” and put him on a tour to sell war bonds. Chafing at what he felt was inaction, Rogers jumped at the chance to join the real fighting when he received news of the capture of his friend Barnes’ army division and rushed to rescue the soldiers. Upon the successful completion of the unplanned mission—and a brief meeting with the Red Skull himself—Rogers determined his path as a one-man fighting force. \n\n <b> The First Avenger </b> \n\n After truly joining the fight in World War II thanks to his rescue of captured troops, including his old friend Bucky Barnes, Captain America quickly earned the respect and admiration. And it was not only from the soldiers he fought alongside, but also from British secret agent Peggy Carter, an expert on Hydra, who had served as Erskine’s assistant on the Super-Soldier program. After a series of battles overseas, Rogers, Barnes, and the Howling Commandos strike force staged an assault on a train carrying Hydra personnel, during which Barnes seemingly fell to his death. Grieving over the loss, Rogers nevertheless continued his campaign against Hydra, while also growing closer to Peggy. \n\n Captain America took the fight directly to the Red Skull when he led an invasion of the villain’s base in an all-out attempt to break Hydra’s hold on the war. Rogers successfully boarded the Skull’s aircraft as it took off to launch an attack on the United States. But, when his foe’s powerful Tesseract energy source spelled the Red Skull’s doom, the Super-Soldier found himself with no other alternative then to purposefully crash the plane to stop its pre-programmed drive toward America. While Peggy Carter listened through radio communications with the aircraft, Steve Rogers took it down into the icy North Atlantic waters and apparently to his death. \n\n Instead, Captain America entered into a state of suspended animation after the crash, and was recovered in the present day by S.H.I.E.L.D., the successor to Peggy Carter’s Strategic Scientific Reserve. Awakened, he learned of his current status and began the long journey to acclimating to a brand-new, modern world. \n\n Almost immediately upon Steve Roger’s revival in the present, he was offered a spot in Nick Fury’s Avengers Initiative and took his place among other heroes, including Iron Man, Thor, Black Widow, Hawkeye, and the Hulk. The group first came together to battle Thor’s brother Loki. However, their initial teamwork was marred by internal strife, chiefly between Rogers and Tony Stark AKA Iron Man, the son of Rogers’ old wartime companion, Howard. The team eventually finally truly came together in the wake of their colleague Phil Coulson’s death at the hands of Loki.\n\n In the ensuing battle in New York between the Avengers and Loki and his alien forces, Captain America took charge as a natural leader, coming up with an on-the-spot plan to contain the fight as much as possible to help innocent civilians escape. Loki was defeated. While the Avengers parted ways for the time being, the group had developed mutual respect for one another, as well as the desire to maintain the team when they were needed to address larger threats. \n\n After filming a series of Public Service Announcements on different subjects for high school students, Captain America continued to acclimate to modern times and forged friendships with fellow Avenger Natasha Romanoff AKA Black Widow and a USAF operative named Sam Wilson. Rogers was spending much of his time assisting S.H.I.E.L.D. in the field. \n\n Both Romanoff and Wilson aided him when it was discovered that Hydra had long ago infiltrated S.H.I.E.L.D. and Rogers was on the run after an attempt to silence him. Rogers found another ally in Sharon Carter, an undercover S.H.I.E.L.D. agent he would later learn was Peggy Carter’s great niece. At this time, Rogers also discovered his old friend Bucky Barnes had not in fact died during World War II, but became a brainwashed sleeper agent and assassin for Hydra called the Winter Soldier. In the midst of stopping Hydra’s nefarious “Project Insight” program, Cap and Bucky battled, and Cap’s pleas to his old friend to remember who he was finally seemed to succeed, as Bucky saved Rogers from drowning, though he vanished in the aftermath."
  },
  {
    "name": "Iron Man",
    "realname": "Tony Stark",
    "team": "Avengers",
    "firstappearance": "1963",
    "createdby": "Stan Lee",
    "publisher": "Marvel Comics",
    "youtubeURL": "https://www.youtube.com/watch?v=5evGlVgmmfM",
    "IMDB": "7.9/10",
    "imageurl": "https://www.simplifiedcoding.net/demos/marvel/ironman.jpg",
    "bio": "\r\n\t\tAnthony Edward Stark, the son of wealthy industrialist and head of Stark Industries, Howard Stark, and Maria Stark. A boy genius, he enters MIT at the age of 15 to study electrical engineering and later receives master's degrees in electrical engineering and physics. After his parents are killed in a car accident, he inherits his father's company.\r\n\t\t Genius inventor Tony Stark continued his father Howard Stark’s weaponry business after his parents’ untimely deaths and flew it to even greater heights of innovation. While in Afghanistan to demonstrate a new missile for the U.S. military, Stark’s convoy came under fire by a terrorist group known as the Ten Rings and he was severely wounded. Taken prisoner by the group, Stark awoke in their headquarters to learn that shrapnel near his heart had nearly cost him his life, but swift action by scientist and fellow prisoner Ho Yinsen—who had inserted a powerful electromagnet in Stark’s chest—would prolong it temporarily. \n\n Stalling his captors after they demanded he build them a new weapon, Stark replaced the magnet with the RT, a miniature version of a device originally designed by his father, the Arc Reactor. Furthermore, he and Yinsen created a crude suit of armor which could provide them the means with which to escape. The suit worked as planned, though Yinsen sacrificed himself in order to allow Tony enough time to power it up to fight their terrorist captors.\n\n With help from his friend Lt. Colonel James Rhodes, the inventor returned home and promptly announced Stark Industries departure from the weapons business. His personal assistant Pepper Potts backed the sudden course reversal, but his father’s old friend and business partner, Obadiah Stane, strongly disagreed with what he saw as a rash decision. \n\n Stark worked overtime in his lab to streamline the armor, and when he’d finished, a new persona emerged: Iron Man. After he discovered Stane had illegally sold Stark weapons to the Ten Rings, he donned the armor to return to Afghanistan and stop the group from using them. Later, he also learned that Stane had paid the Ten Rings to kill him and had been working behind Stark’s back to steal the entire company. The older man then forcibly took the RT from Tony’s chest and left his old friend’s son to die. But, Potts helped Stark insert his original, cobbled-together RT into his chest, and Iron Man flew again.\n\n Stane presented himself in a gigantic suit of armor of his own, and a battle ensued until Stark and Potts overloaded Stane’s power source and Stane died in the process. Feeling more confident in himself than ever before, Stark called a press conference soon after the fight and impulsively announced to the world that he was indeed Iron Man. \n\n <b> Heart of Steel </b> \n\n At the very core of the Iron Man technology lies the Arc Reactor. Designed by Howard Stark, but augmented and strengthened by Tony Stark, the Reactor provides a clean, manageable energy source with incredible output, one that can be adapted to most anything. At first a large piece of equipment, the younger Stark miniaturized the technology into the “RT,” which was the size of a human heart, and put it to great use to power his suits of armor. \n\n Iron Man’s armor provided a complete working environment for its user, including enhanced strength, closed air systems, data input, communications, flight, defense systems, and offensive weaponry such as missiles, lasers, and so-called “repulsor” technology. Stark never stops in his advancement of his armor designs, and at one time created multiple versions, each one of them with a specialized use. The armor has also become lighter and more flexible since the first incarnation, allowing Stark to “suit up” in mere seconds and be immediately ready for action. \n\n Stark’s latest suit was destroyed in battle with the tyrant Thanos, but while in use sported maximum thrust for flight, new offensive weapons, and nanotechnology that allowed near instantaneous application."
  },
  {
    "name": "Wolvarine",
    "realname": "James Howlett",
    "team": "X-Men",
    "firstappearance": "1974",
    "createdby": "Len Wein",
    "publisher": "Marvel Comics",
    "youtubeURL": "https://www.youtube.com/watch?v=wnww8PunWII",
    "IMDB": "6.7/10",
    "imageurl": "https://www.simplifiedcoding.net/demos/marvel/logan.jpg",
    "bio": "\r\n\t\tWolverine was born James Howlett in northern Alberta, Canada, during the late 1880s, purportedly to rich farm owners John and Elizabeth Howlett,[27] though he is actually the illegitimate son of the Howletts' groundskeeper, Thomas Logan.[28] After Thomas is thrown off the Howletts' property for an attempted rape perpetrated by his other son, named simply Dog, he returns to the Howlett manor and kills John Howlett. In retaliation, young James kills Thomas with bone claws that emerge from the back of his hands, as his mutation manifests.[29] He flees with his childhood companion, Rose, and grows into manhood on a mining colony in the Yukon, adopting the name \"Logan\".[30] When Logan accidentally kills Rose with his claws, he flees the colony and lives in the wilderness among wolves,[31] until he is captured and placed in a circus.[32] Saul Creed, brother of Victor Creed, frees Logan, but after he betrays Logan and Clara Creed to Nathaniel Essex, Logan drowns Creed in Essex's potion.[33] Logan returns to civilization, residing with the Blackfoot people. Following the death of his Blackfoot lover, Silver Fox, at the hands of Victor Creed, now known as Sabretooth,[34] he is ushered into the Canadian military during World War I. Logan spends time in Madripoor before settling in Japan, where he marries Itsu and has a son, Daken. Logan is unaware of his son for many years.\r\n\t\t <b> Slashing Skills </b> \n\n Wolverine’s rapid regeneration powers allow him to bounce back from almost every type of bodily wound on the condition that his head remains firmly attached to his shoulders. Nevertheless, the time of each healing is understandably proportionate to the severity of the injury. His body is also immune to most poisons, drugs, and diseases; his agility, reflexes, and senses are similarly enhanced. Wolverine sees and hears things at distances far greater than those of ordinary humans. His sense of smell is even more magnified and he can recognize people and objects by scent alone, which, combined with combat and stealth training, makes him one of the world’s foremost trackers. \n\n The most iconic of his natural weapons are six retractable, slightly curved, foot-long bone claws, three in each arm, beneath the skin and muscle of his forearms. He can, at will, release these claws through the skin beneath his knuckles. The claws are naturally sharp and tougher than normal human bone, allowing them to penetrate most types of flesh and natural materials. \n\n He has an extra defense from the Weapon X program, where his skeleton was coated in the near-indestructible steel alloy known as adamantium. This adds an extra 105 pounds to his frame—or 47.6 kilograms in Mr. Howlett’s native metric system. Immediately after this procedure, his healing factor was slowed so that it might take weeks to recover from multiple wounds, but eventually the factor returned to full strength and speed. The adamantium renders his bones virtually unbreakable and his claws capable of penetrating almost any substance depending on its thickness and the force he exerts. His reinforced skeleton also enables him to withstand heavy physical pressure, giving his muscles sufficient force to briefly lift 800 pounds or more. \n\n To top things off, Wolverine is trained in hand-to-hand combat, computer systems, vehicles, weapons, and is fluent in Cheyenne, Chinese, Japanese, Korean, Lakota, Russian and Spanish, with some French, Thai, and Vietnamese. "
  },
  {
    "name": "Spiderman",
    "realname": "Peter Parker",
    "team": "Avengers",
    "firstappearance": "1962",
    "createdby": "Stan Lee",
    "publisher": "Marvel Comics",
    "youtubeURL": "https://www.youtube.com/watch?v=Lxx0JErW4Vc",
    "IMDB": "7.3/10",
    "imageurl": "https://www.simplifiedcoding.net/demos/marvel/spiderman.jpg",
    "bio": "\r\n\t\tIn Forest Hills, Queens, New York,[43] Midtown High School student Peter Parker is a science-whiz orphan living with his Uncle Ben and Aunt May. As depicted in Amazing Fantasy #15 (Aug. 1962), he is bitten by a radioactive spider (erroneously classified as an insect in the panel) at a science exhibit and \"acquires the agility and proportionate strength of an arachnid\".[44] Along with super strength, Parker gains the ability to adhere to walls and ceilings. Through his native knack for science, he develops a gadget that lets him fire adhesive webbing of his own design through small, wrist-mounted barrels. Initially seeking to capitalize on his new abilities, Parker dons a costume and, as \"Spider-Man\", becomes a novelty television star. However, \"He blithely ignores the chance to stop a fleeing thief, [and] his indifference ironically catches up with him when the same criminal later robs and kills his Uncle Ben.\" Spider-Man tracks and subdues the killer and learns, in the story's next-to-last caption, \"With great power there must also come-great responsibility!\r\n\t\t <b>To Squash a Spider </b> \n\n Spider-Man has yet to attract a sizable Rogues Gallery, but his first real Super Villain adversary is Adrian Toomes, the Vulture. \n\n Over the course of Spider-Man’s interactions with the Vulture, he advanced from a nuisance in Toomes’ eyes to a true obstruction in the man’s schemes. Toomes also perhaps saw a bit of himself in Spider-Man, albeit at a younger age. Unfortunately, the Vulture discovered his foe’s secret identity and was able to initially warn Parker off with threats toward his family and friends. But, the young man’s sense of responsibility and justice outweighed any fear and he did everything within his power to ensure that Toomes never flew again. Now in prison, the Vulture still harbors Spider-Man’s secret, though he had decided to keep that to himself as an apparent sign of respect towards his enemy. \n\n In addition to the Vulture himself, two of his associates may also still cause trouble for Spider-Man: Herman Schultz, AKA the Shocker, who wields a powerful gauntlet inherited from his late colleague, Jackson Brice, and Mac Gargan, a dangerous criminal who was injured in a confrontation with Spider-Man. Both men have been incarcerated, but Gargan in particular seems eager to enact his revenge on New York’s young champion.\n\n When Thanos made his play for the Infinity Stones, Spider-Man, coming to Iron Man’s aid, placed himself in direct opposition to both Thanos and those who serve him."
  },
  {
    "name": "Thor",
    "realname": "Thor Odinson",
    "team": "Avengers",
    "firstappearance": "1962",
    "createdby": "Stan Lee",
    "publisher": "Marvel Comics",
    "youtubeURL": "https://www.youtube.com/watch?v=JOddp-nlNvQ",
    "IMDB": "7/10",
    "imageurl": "https://www.simplifiedcoding.net/demos/marvel/thor.jpg",
    "bio": "\r\n\t\tThor's father Odin decides his son needed to be taught humility and consequently places Thor (without memories of godhood) into the body and memories of an existing, partially disabled human medical student, Donald Blake.[52] After becoming a doctor and on vacation in Norway, Blake witnesses the arrival of an alien scouting party. Blake flees from the aliens into a cave. After discovering Thor's hammer Mjolnir (disguised as a walking stick) and striking it against a rock, he transforms into the thunder god.[53] Later, in Thor #159, Blake is revealed to have always been Thor, Odin's enchantment having caused him to forget his history as The Thunder God and believe himself mortal.\r\n\t\t Thor was born to the King of the Asgardian Gods, Odin Borson, and the Earth Goddess Gaea. He grew up in Asgard under Odin's tutelage and trained in his footsteps to one day lead Asgard. Besides Odin, his stepmother Frigga and his adopted brother Loki are the only family he know, alongside his best friends Sif, Balder, and the Warriors Three. \n\n Throughout his youth, Thor tested his limits on dangerous missions and became worthy of the Uru hammer Mjolnir, using it to save Sif from the Death Goddess Hela. While the hammer wields destructive powers, it also has the power to build and Thor also uses it to consecrate treaties and bless weddings. \n\n In Thor's coming of age, he fell through a portal and battled the demigod Hercules. Equal in strength, they fought until Zeus halted their encounter, sending Thor back to Asgard and wiping the memories of both warriors. During the 9th Century, Thor spent time on Earth, leading Vikings into battle. It was not until Thor's loyal Vikings attacked a Christian monastery that he turned his back on his followers, leaving Earth and spending centuries in Asgard. \n\n During his time in Asgard, Odin casted Thor into the mortal guise of Siegmund to retrieve the Rhinegold Ring from the dragon Fafnir. When Siegmund took away another's wife, Frigga compelled Odin to kill Thor, but Thor survived as Siegmund's son Siegfried. Odin succeeded at obtaining the Rhinegold Ring from Siegfried, then restored Thor to life without any memories of his former identities. \n\n When Thor's battle-hungry appetite led him to break a treaty between Asgard and the Frost Giants, Odin banished him to Earth as a lesson in humility in the form of Dr. Donald Blake. As a human, he had a limp and worked as a physician. When he was compelled by Odin to go to Norway, he came upon extraterrestrials known as the Kronans and fled into a cave. There, he found a gnarled cane and used it to try and escape; he struck it against a rock, and it became Mjolnir. The mallet then restored his memories and returned him to his former glory as the mighty God of Thunder. \n\n When Loki became a menace and deceived his brother Thor on Earth, Thor saw through his lies and banded together with Iron Man, the Hulk, Ant-Man, and Wasp to found the Avengers. Alongside the Avengers, Thor is a leader, master hand-to-hand combatant, and talented swordsman."
  },
  {
    "name": "Hulk",
    "realname": "Robert Bruce Banner",
    "team": "Avengers",
    "firstappearance": "1962",
    "createdby": "Stan Lee",
    "publisher": "Marvel Comics",
    "youtubeURL": "https://www.youtube.com/watch?v=1fAs9WPb2sY",
    "IMDB": "5.6/10",
    "imageurl": "https://www.denofgeek.com/wp-content/uploads/2019/03/incredible-hulk-key-art.jpg?fit=1200%2C675",
    "bio": "\n\t\tBioscience genius Dr. Bruce Banner focused his major studies on the effects of gamma radiation on humans, working alongside Dr. Betty Ross at a Virginia University lab. Dr. Ross’ father, General “Thunderbolt” Ross of the U.S. Army, channeled Banner’s work into a program to develop weapons for the military, unbeknownst to both doctors. When Banner decided to test what he learned on himself, he triggered a fantastic transformation in himself that resulted in an immense, hulking figure fueled by his own rage. \n\n Having destroyed his lab as the creature, and inadvertently harming Ross in the process, Banner slipped away to avoid capture and study by the Army and began a desperate quest for a cure to his bizarre affliction. \n\n As intelligent and cerebral as Bruce Banner is, his alter-ego the Hulk is a completely physical phenomenon. The green behemoth possesses the greatest raw strength of any natural being on Earth, with an upper limit that has yet to be fully tested. His leg muscles allow him to leap great distances and land without harm, and his skin can resist damage from heavy weaponry, as well as the natural elements and even unnatural ones. \n\n The Hulk has grown somewhat more intelligent over the years, beginning with the mind of nearly an infant and progressing to what might be described as the personality of a toddler. His speech has increased from growls and roars, to one or two words at a time, to full sentences, albeit broken and naïve. Banner recognizes the Hulk as himself, but often refers to him as “the other guy,” while his alter-ego seems to have little love or respect for the mild scientist and may not even be cognizant that Banner is himself.\n\n The doctor transforms into the Hulk during moments of stress, anxiety, and most of all anger. The change can reverse itself if the Hulk reaches a state of calm, either by himself or through a special mantra utilized by his fellow Avengers, most notably Natasha Romanoff, the Black Widow. "
  },
  {
    "name": "Wanda Maximoff",
    "realname": "Scarlet Witch.",
    "team": "Avengers",
    "firstappearance": "1964",
    "createdby": "Stan Lee",
    "publisher": "Marvel Comics",
    "youtubeURL": "https://www.youtube.com/watch?v=y4oH7qOhWMc",
    "IMDB": "8.1/10",
    "imageurl": "https://nerdist.com/wp-content/uploads/2021/02/Wanda-Maximoff-Civil-War.jpg",
    "bio": " <p>Sokovian native Wanda Maximoff and her twin brother Pietro survived an explosion in their apartment building that killed both of their parents. Another missile landed, but did not explode. It terrorized them for days as they remained stuck in the rubble, with the deadly device in front of them, the name Stark emblazed on its side.</p> <p>Years later, they both volunteered to undergo genetic experimentation overseen by HYDRA’s Baron Wolfgang von Strucker, using Loki’s scepter, to potentially give them powers. One of the few survivors of the experiments, along with her brother, Wanda found herself with a variety of abilities. Alongside Pietro, Wanda went on to use these abilities to help the robot Ultron, who shared her disdain for Tony Stark.</p> <p> However, when she and Pietro discovered the true nature of Ultron’s plans, they switched allegiances and joined the fight against him, putting Wanda on the path to become an Avenger.</p> <p> The full extent of Wanda’s considerable powers has likely not been fully documented as of yet.As her powers likely come at least in part from the Mind Stone inside of Loki’s scepter, Wanda’s abilities include telekinesis, energy manipulation, and some form of neuroelectric interfacing that allows her to both read thoughts and also give her targets waking nightmares. Under the tutelage of Avengers Captain America and Black Widow, she has learned not only to hone her abilities further, but also hand-to-hand combat and tactical skills. </p> <p> <b>The Witch List</b> </p> <p> Wanda Maximoff’s enemies shift significantly as she changes allegiances.Because Stark missiles kill her parents and nearly kill her and her twin brother Pietro, Wanda spends much of her youth hating Tony Stark. Her initial ally, Ultron, plays off of that rage and manipulates the twins into working for him against the Avengers. However, she comes to see the genocidal Ultron as the true enemy and helps stop his evil scheme. While the relationship between her and Stark does not develop into friendship, they do become teammates as part of the Avengers.</p><p> Wanda later finds a fearsome foe in Thanos, whose goal to gain all six Infinity Stone sets him on a path to Vision, who holds the Mind Stone. Thanos’ quest pits Wanda against two of his followers, Proxima Midnight and Corvus Glaive, and eventually Thanos himself. Wanda defeats Proxima Midnight to defend her allies, Black Widow and Okoye. Although Wanda opposes Thanos’ goal to end half the life in the universe, he is a much more personal enemy, given her love for Vision and her desire to save his life. She stands staunchly against the Mad Titan in attempt to prevent him from taking the Mind Stone for himself.</p>"
  },
  {
    "name": "Thanos",
    "realname": "Josh Brolin Damion Poitier",
    "team": "Avengers",
    "firstappearance": "1973",
    "createdby": "Jim Starlin",
    "publisher": "Marvel Comics",
    "youtubeURL": "https://www.youtube.com/watch?v=osSJhXruEzU",
    "IMDB": "8.3/10",
    "imageurl": "https://i.insider.com/5a1eb89d3339b0962f8b459e",
    "bio": "\n\n\t\t He is perhaps the most evil, bloodthirsty, and powerful villain in the universe—so powerful that religious sects have worshipped him as a god. His enemies include nearly every Super Hero in existence. He is obsessed with Goddess Death and has waged genocidal campaigns in an attempt to placate her. Most famously, he has attempted to conquer the universe by wielding the Infinity Gauntlet. He is the Mad Titan.\n\n He is Thanos.\n\n <b>Divine Right</b> \n\n As both god and ruler of the Endless Resurgence empire, Thanos controlled his people through a combination of force and fear, viewing freedom as disorder, as a hole in the universe that allows for in randomness and chaos. He saw death as an end to uncertainty, and so, he loved it. Thanos viewed his reign as the natural order of thing. To him, fate and chance are always at war, and his rule demonstrates the preeminence of fate. To help him with his domination, he once possessed a powerful cube that erased the will of his people. Unfortunately for him, he lost it under mysterious circumstances millennia ago, and has since been attempting to get it back. \n\n Unsurprisingly, many civilizations did not enjoy or want Thanos' brutal leadership. Thanos dealt with such uprising brutally, have his soldiers, the Ravens and the Bombardiers, and his sons, such as Gallowglass and Ronan the Accuser, quell any dissidence. For example, after the planet Pyx rose up against his rule, Thanos ordered Ronan to kill all males there over the age of 10. \n\n From his birth on Saturn's moon of Titan, Thanos was always an outsider. He carries a Deviants gene, which causes his gruesome and misshapen appearance, with purple, rugged skin. He was born among the last sons of Titan's original colonists: Mentor and Sui-San. His mother, shocked to see such an ugly baby, and sensing his potential for evil, tried to kill Thanos at birth, although she was stopped by his father, A'Lars, AKA Mentor. Thanos later killed her for this attempt. Thanos also has a brother, Starfox (AKA Eros), who he was always jealous of, as Starfox was handsome and popular. \n\n Still, Thanos is an Eternal, a type of super human who, according to the Celestials, was meant to be a protector of Earth. And, with a twisted mind, he took his cosmic duty to heart."
  },
  {
    "name": "Deadpool",
    "realname": "Wade Wilson",
    "team": "X-Force",
    "firstappearance": "1991",
    "createdby": "Fabian Nicieza and Rob Liefeld",
    "publisher": "Marvel Comics",
    "youtubeURL": "https://www.youtube.com/watch?v=Xithigfg7dA",
    "IMDB": "8/10",
    "imageurl": "https://miro.medium.com/max/3840/1*0ubYRV_WNR9iYrzUAVINHw.jpeg",
    "bio": "\n\n\t\t Welcome to the Deadpool character bio, nerds! I mean...True Believers! Brought to you by me, myself, and I: the fabulous Deadpool! I could have let some smelly pencil-pushing intern spell out my life story for you, but you deserve better. \n\n So, here it is, straight from the Merc with a Mouth's mouth—every detail of my morally ambiguous, mentally unstable, innuendo-laden past. From my very first appearance in NEW MUTANTS #98, to my latest booty-kicking, comic relief-ing anti-heroics, to a third thing that I can't think of right now, this is the definitive history of Deadpool. \n\n Okay, intro's over. Let the solemn origin story fade in? \n\n <b> My origin </b> \n\n Call me Ishmael. \n\n Just kidding. Don't do that.\n\n Like any misunderstood hero, I probably had a difficult childhood that led to my career as a professional killer. That, or someone brainwashed me into murdering my parents. If I don't remember, does it really count? Or matter? \n\n Let's just say that I was an orphan, a wizard put me on my aunt and uncle's doorstep, they raised me in secret, and then I went to a special magic school where a bald man regularly tried to murder me with voodoo. \n\n Okay, that's not true...but I do have a scar on my forehead! Several, actually! \n\n Anyway, seriously, I joined the military at 17 years-old, but was discharged soon thereafter. So, naturally, I decided to become an assassin (which is, by the way, an incredibly fun word to write). \n\n Then I met Wade and Mercedes Wilson, a young couple that nursed me back to health after an early failed job. Some may say that I killed them both in an attempt to steal Wade's identity, but guys, come on. I'm the real Wade Wilson. \n\n While working as a hired gun, I met the expensively beautiful Vanessa Carlyle, and we made a perfectly dysfunctional pair. I then got an assignment to kill a British operative named Althea (important moment readers, I'm meeting my best friend here) but decided to kill everyone else instead. Doing this made my employers...unhappy. So they tried to kill Vanessa. Luckily, a special agent named Zoe Culloden—who'd been spying on me to try and convert me into some kind of messiah protector—rescued Vanessa. Weird subplot, I know.Cue my first life-defining moment: they gave me inoperable cancer. Low blow. I dumped Vanessa and joined a Weapon X program, where a few experiments served me up fresh and cancer free—with a side order of healing powers. Mmm, tasty! I joined their internal team of mercenaries, but my powers had some performance issues, so the department sent me off to die quietly in a place called Hospice. As if a painful, slow death could shut this mouth up. Clearly, these guys hadn't read any of my supporting literature. \n\n There were a few other guys stuck in there with me, and we had a betting pool over who would kick the bucket first. We called it the dead pool, and because I'm a clever girl and because my name needed some kind of logic behind it, I adopted the moniker Deadpool. What? No, I disagree, it's not a reach at all."
  },
  {
    "name": "Clint Barton",
    "realname": "Jeremy Renner",
    "team": "Avengers",
    "firstappearance": "2011",
    "createdby": "Stan Lee and Don Heck",
    "publisher": "Marvel Comics",
    "youtubeURL": "https://www.youtube.com/watch?v=VM4_X0MVLzY",
    "IMDB": "N/A",
    "imageurl": "https://images.hindustantimes.com/rf/image_size_630x354/HT/p2/2018/09/11/Pictures/null_495f16c2-b5a2-11e8-bbaf-ff4d73ce44e3.jpg",
    "bio": "\n\n\t\t The man who would become known as Hawkeye was born Clint Barton. Orphaned at an early age, he joined the circus and apprenticed himself to the Swordsman, a performer who specialized in tricks with blades. After he discovered the Swordsman stealing from the circus, the two fought, and Barton was left for dead. Barton recovered, and he continued his martial training with the circus’s resident archer, Trickshot. Barton excelled with the bow, and he decided to use his skills to embark on a career as a costumed crime fighter named Hawkeye. After some initial misadventures, Hawkeye proved his worth to the Avengers, and he was a regular member of that group’s rotating cast throughout the 1960s. At the end of that decade, he used a growth serum developed by fellow Avenger Hank Pym and became the giant-sized Goliath, a role he kept for the next several years. \n\n When Barton resumed his Hawkeye persona in the early 1970s, he found that his old skills as an archer had not deserted him. The ensuing decade was a restless one, however. It was characterized by numerous stints with the Avengers and other teams, and by the early 1980s, Hawkeye was a solo crime fighter. During this time, Barton fell in love with and married Barbara (“Bobbi”) Morse, who was otherwise known as the costumed adventurer Mockingbird. Together, the pair recruited their own team, the West Coast Avengers (featuring Iron Man, Tigra, and Wonder Man). After several years, the West Coast Avengers began to fall apart, and Mockingbird was apparently killed by the evil demon Mephisto. The rest of the group split off to form Force Works, while Hawkeye, alone once more, retreated to the wilderness. \n\n Feeling the need for human company, he drifted back to the Avengers before assuming leadership of the Thunderbolts, a team that proved to be one of Marvel’s most enduring creations of the 1990s. Although the premise of villains acting on the side of the law was not wholly original—John Ostrander’s Suicide Squad covered that ground a decade earlier—the monthly Thunderbolts comic focused on themes of redemption that were largely absent from Ostrander’s work. After a dramatic lineup change in the Thunderbolts in 2003, Hawkeye returned to the Avengers, and he was seemingly killed while fighting the alien Kree the following year. In typical comic fashion, Barton was eventually resurrected, and he joined the New Avengers as the costumed martial artist Ronin. Believing Barton to be dead, Kate Bishop, a bow-wielding member of the Young Avengers, adopted the name Hawkeye, retaining it even after Barton resumed his Hawkeye identity as a member of Captain America’s Secret Avengers. Both Hawkeyes were featured in writer Matt Fraction and artist Daniel Aja’s Hawkeye, which debuted in August 2012. The critically acclaimed book was a gritty street level tale about crime in the city, but it was infused with humour and character-driven stories that made it a novelty among monthly superhero titles."
  },
  {
    "name": "Loki",
    "realname": "Tom Hiddleston",
    "team": "Avengers",
    "firstappearance": "1962",
    "createdby": "Stan Lee, Larry Lieber, penciller Jack Kirby ",
    "youtubeURL": "https://www.youtube.com/watch?v=UlnufxrJlAk",
    "IMDB": "N/A",
    "publisher": "Marvel Comics",
    "imageurl": "https://i.cdn.newsbytesapp.com/images/l205_32701605867168.jpg",
    "bio": "\n\n\t\t Loki, Prince of Asgard, Odinson, rightful heir of Jotunheim, and God of Mischief, is burdened with glorious purpose. His desire to be a king drives him to sow chaos in Asgard. In his lust for power, he extends his reach to Earth where he believes they need a ruler and encounters unlikely heroes that interfere with his schemes. \n\n <b> God of Mischief </b> \n\n The ever-scheming Loki, raised as the son of King Odin and Queen Frigga of Asgard, is resentful of living in his brother Thor’s shadow. Loki studied magical arts earning the “God of Mischief” title, while his brother pursued physical prowess. Believing himself to be the rightful King of Asgard, Loki schemes to undermine the God of Thunder’s ascension to the throne, desperate for his father’s approval and to be seen as an equal to Thor. \n\n During Thor’s banishment to the realm Midgard, Odin revealed Loki’s true parentage. Ages ago, Odin fought and defeated Laufey and the Frost Giants of Jotunheim in a great war. Abandoned and left for dead as a baby due to his diminutive size, Odin took Loki, son of Laufey, to Asgard to raise him as his son and a prince in order to one day unite the Frost Giants and the Asgards in peace.\n\n Furious that he had been lied to all his life and used as Odin’s political pawn instead of loved as his son, Loki set on several paths to prove his worth of the throne and superiority over Thor.\n\n <b>Liesmith</b> \n\n Loki possesses strength, durability, and longevity far superior to humans. The most powerful sorcerer in all of Asgard, Loki’s magical abilities include astral projection, shape-shifting, hypnosis, molecular rearrangement, energy blasts, levitating, conjuration, cryokinesis, telekinesis and teleportation. In addition, Loki can connect to others telepathically and see into their memories, mystically imbue objects, and create rifts between dimensions.\n\n A master of manipulation and deceit, Loki is highly intelligent with immense knowledge and skill in wielding mystical artifacts, arcane lore, and human as well as alien technology. A highly-tactical thinker, Loki is able to manipulate opportunities and events in his favor; his cunning mind far exceeding Thor and Odin’s.\n\nLoki, an expert combatant, typically wields throwing knives and other small blades. The God of Mischief has also wielded a Chitauri Scepter gifted by the Other and Thanos, Odin’s Gungnir spear, the Casket of the Ancient Winters, and the Tesseract."
  },
  {
    "name": "Black Panther",
    "realname": "T'Challa",
    "team": "Avengers",
    "firstappearance": "1966",
    "createdby": "Stan Lee and Jack Kirby ",
    "publisher": "Marvel Comics",
    "youtubeURL": "https://www.youtube.com/watch?v=xjDjIWPwcPU",
    "IMDB": "7.3/10",
    "imageurl": "https://cms.qz.com/wp-content/uploads/2018/02/black-panther-e1513870292357.jpg?quality=75&strip=all&w=1600&h=900&crop=1",
    "bio": "\n\n\t\t A native of the small, yet technologically advanced African nation of Wakanda, T’Challa accepted the mantle of Black Panther, the legendary protector of the Wakandan people, from his father, King T’Chaka, who filled the role before him as his father before him and so on. T’Chaka relinquished the title as he grew older and delved further into politics. This was a subject T’Challa looked upon with some dislike, although he acknowledged the increasing importance of it, even as Wakanda maintained an air of secrecy to hide its true nature and precious vibranium mines. \n\n Regardless of his feelings for Wakanda’s part on the world stage, T’Challa accompanied T’Chaka to an international summit in Vienna, Austria to ratify the Sokovia Accords, which promised to regulate all enhanced persons. Sadly, T’Chaka lost his life when Sokovian radical Helmut Zemo detonated a bomb at the well-attended meeting of heads of state, framing Bucky Barnes, the Winter Soldier, in the process. At that moment, not only did the throne of Wakanda pass to T’Challa, but also the full weight of the Black Panther’s responsibilities, including the task of revenge for the death of the king. \n\n <b> Panther’s Bite </b> \n\n T’Challa wears a high-tech suit as the Black Panther, including a mask which hides his features and provides him with overall stealth capabilities. With vibranium threads woven throughout, the suit offers protection from gunfire as well as the elements, and responds to T’Challa’s smallest touch. In keeping with the panther motif, the gear also features retractable vibranium claws, night vision optics, and is ultra-light and form-fitting. In addition, the Black Panther can also absorb energy directed toward him, physical or otherwise, which may then be redirected outward for defense and offense. \n\n The king of Wakanda is also the recipient of the nation’s rare heart-shaped herb, which endows him with enhanced strength, speed, agility, and stamina. During a special ceremony, ingestion of the herb also opens T’Challa up to communication from his departed ancestors in the afterlife, including his late father. \n\n <b>Panther's Enemies</b> \n\n Technically, all those who oppose Wakanda or seek to harm it would be considered enemies of the Black Panther, but a particular few have risen up to demand T’Challa’s focused attention. \n\n The mercenary Ulysses Klaue steals vibranium from the small nation, an act of high sacrilege in Wakanda that earns him T’Challa’s enmity. \n\n It was another adversary, Erik Killmonger, who ends Klaue’s terror spree, when he felt he no longer needed the mercenary to help him gain control over Wakanda. Though expressing a legitimate challenge to the Black Panther title and mantle, Killmonger’s drive to drain the nation’s resources to uplift others around the globe brought him to a tragic end after battling T’Challa. \n\n Helmut Zemo’s plan to take revenge on the Avengers for the death of his family in Sokovia unfortunately sweeps T’Challa and his own family up into its dark maw. Zemo orchestrates a bomb attack that kills T’Chaka, the Panther’s father, an act that T’Challa in turn seeks to avenge. Ultimately though, the Wakandan prince not only stops himself from murdering Zemo but stops Zemo from committing suicide, taking him into custody instead. \n\n T’Challa’s protection of Vision brings Thanos’ army to Wakanda, making the Black Panther an enemy of Thanos in the process."
  },
  {
    "name": "Jean Grey",
    "realname": "Jean Elaine Grey",
    "team": "Avengers",
    "firstappearance": "1963",
    "createdby": "Stan Lee and Jack Kirby ",
    "publisher": "Marvel Comics",
    "youtubeURL": "https://www.youtube.com/watch?v=azvR__GRQic",
    "IMDB": "5.7/10",
    "imageurl": "https://img.cinemablend.com/filter:scale/quill/1/6/0/d/2/f/160d2fecd5a21712d1336b6f11734abbfa9ed556.jpg?fw=1200",
    "bio": "\n\n\t\t The younger daughter of history professor John Grey and his wife Elaine, Jean Grey was 10 years old when her mutant telepathic powers first manifested after experiencing the emotions of a dying friend. Her parents took her to be treated by Professor Charles Xavier. While Xavier treated Jean he also used her to fine tune his Cerebro machine. When Xavier introduced young Jean to the astral plane a part of her mind manifested as a Phoenix raptor and touched the mind of Scott Summers in the orphanage. Later, Xavier erected psychic shields in Jean’s mind to prevent her from using her telepathic powers until she was mature enough to control them. Eventually, using her telekinetic powers, Jean was a founding member of Xavier’s team of mutant trainees the X-Men as Marvel Girl. Upon a mission in outer space Jean was noticed by the Phoenix Force which took note of her unlimited potential. At this moment Jean had a vision of becoming the Phoenix but the vision faded from her memory as it ended. She soon fell in love with fellow student Scott Summers, and later would develop a strong attraction towards one of the team’s new recruits, the feral Wolverine. \n\n After Jean and the X-Men defeated scientist Stephen Lang and his robotic Sentinels on his space station, the heroes escaped back to Earth in a shuttle through a lethal solar radiation storm. Dying from radiation poisoning, Jean was saved by the cosmic entity known as the Phoenix Force who created a duplicate body complete with memories and personality, absorbed a portion of her consciousness and cast her into suspended animation in a strange cocoon at the bottom of Jamaica Bay.\n\n For months the Phoenix believed itself to be the real Jean and saved the universe by healing the M’Kraan Crystal. Mental manipulation by Mastermind caused Phoenix to go insane and become Dark Phoenix. Ultimately, the portion of Jean’s consciousness within Dark Phoenix resurfaced, causing her to commit suicide. This portion of Jean Grey’s consciousness then journeyed to the afterlife to meet a manifestation of Death. Death explained the Phoenix Force to Jean, who now wore a White Phoenix costume, before this portion of her consciousness and residual Phoenix energy was sent to Jean’s original body in the cocoon, where it was rejected, and then to her clone, Madelyne Pryor. Eventually, Jean was rescued from her stasis and, with the other original X-Men, formed a new team, X-Factor. Madelyne Pryor later died in a confrontation with Jean Grey in which Jean absorbed Madelyne’s and Phoenix’s personalities and memories and a spark of the Phoenix energy. While in battle with a Celestial on an alien world, Jean expelled this spark of energy and the personalities she had absorbed but kept faint impressions of their memories.\n\n Ultimately rejoining the X-Men, Jean and Scott eventually married and were temporarily teleported to a possible future to help raise Nathan Summers. Later, Scott seemingly sacrificed himself to stop Apocalypse from gaining the power of The Twelve. Apocalypse used Scott’s body as a host until his essence was removed from his body by Jean. However, Scott’s corruption by Apocalypse greatly strained his and Jean’s relationship. While on a mission to stop the Stranger from trying to destroy the universe, Jean used the Phoenix Force to get advice from the cosmic being known as Eternity. Later, Jean assumed the position of acting headmistress of the Xavier Institute and was revisited by the Phoenix Force. Following an attack on the X-Men by a mutant impersonating Magneto named Xorn (who had previously been a teacher at the institute), Jean and Wolverine were trapped on a space station that was hurtling into the sun. Seeing no hope for survival and wanting to spare his teammate further suffering, Wolverine seemingly killed Jean, unleashing the Phoenix Consciousness within her and resurrecting her. Returning to Earth, Jean, with the power of the Phoenix, opposed the faux Magneto and was killed by a massive stroke induced by a lethal electromagnetic pulse. \n\n After being killed by the faux Magneto, Jean hatched from a Phoenix Egg in the future. Sublime sought to use Jean’s Phoenix power to control all of creation. However, Jean remembered her mission and destroyed the future reality. Jean ascended to the White Hot Room as a White Phoenix of the Crown and created a new future by pushing Scott to stay with Emma Frost and continue the Xavier Institute.\n\n Later, a band of Shi'ar used their advanced technology to force the Phoenix Force out of the White Hot Room and shattered it with an 'Event Horizon'. Confused and driven insane, the Phoenix flew to Earth and forcefully resurrected Jean Grey. Jean ultimately merged with the Phoenix Force, once again becoming the White Phoenix, and returned to the White Hot Room to find its missing pieces."
  },
  {
    "name": "Nick Fury",
    "realname": "Colonel Nicholas",
    "team": "Avengers",
    "firstappearance": "1963",
    "createdby": "Stan Lee and Jack Kirby ",
    "publisher": "Marvel Comics",
    "youtubeURL": "https://www.youtube.com/watch?v=Jef6OEBXl7w",
    "IMDB": "N/A",
    "imageurl": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/18/25/1529317045-nick-fury-samuel-l-jackson-mcu.jpg",
    "bio": "\n\n\t\t Nicholas Joseph Nick Fury is a world-renowned spy, former Director of S.H.I.E.L.D. and founder of the Avengers. Fury began his career within the United States Army in the late 1960s, rising to the rank of Colonel before his honorable discharge. He later became a CIA operative during the Cold War, primarily operating in Soviet territory. Continuing to serve the world, Fury joined S.H.I.E.L.D. to fight against Earth's most dangerous enemies. The great scope of enemies widened in the 1990s as Fury met Vers, helping her uncover her human heritage as Carol Danvers, as the two fought off the Starforce, which was led by Yon-Rogg, as they were targeting Skrull refugees. Fury took a liking to Goose who scratched him for violating her space and permanently blinded Fury's left eye. Fury kept the reason for this injury secret, telling others it was classified but happened in the line of duty, while Danvers had then left the Earth in order to find a new home for the Skrulls and protect the rest of the universe. \n\n Later promoted to Director of S.H.I.E.L.D. by Alexander Pierce, Fury refocused his efforts over the next 15 years to organize the Avengers Initiative, with Fury's true intentions were to bring together any other powerful individuals to assist S.H.I.E.L.D. with protecting the Earth from extraterrestrial threats, which he had only learned of following his encounters with the Kree and Skrulls. Despite some more considerable reluctance from World Security Council who had not believed in his theories, Fury had still continued his efforts and eventually managed to recruit both Iron Man and Captain America into their Initiative, ready for an incoming invasion. \n\n With the Avengers ready, Fury was forced to call them all into action when the Earth was invaded by Loki, who managed to brainwash an army and steal the Tesseract. With the Avengers assembled, Fury took charge of the hunt for Loki, leading the volatile team through the mission as they attempted to learn what Loki's plan for the Tesseract was and who he had been working for. This all then came to a head following Loki killing Phil Coulson, before being tracked to New York City. There, all the Avengers engaged Loki and his entire incoming army of Chitauri in a final battle, with Fury keeping the World Security Council from nuking the entire city before Loki was defeated and the Avengers were disassembled. \n\n Following the Avengers's victory, Fury recruited Captain America as a S.H.I.E.L.D. agent, while Fury worked on the new Project Insight, as a means of accurately predicting threats; something which conflicted with Rogers' ideals. However, when Fury began to suspect that something was wrong with Project Insight, he then found himself becoming a target of the Winter Soldier, forcing Fury to fake his own death and go into hiding. With limited people he could trust, Fury then turned to Captain America along with Black Widow, the Falcon and Maria Hill to lead the fight, as he soon discovered that HYDRA had secretly managed to infiltrate S.H.I.E.L.D. and Alexander Pierce was the leader, as Captain America had also learned that the Winter Soldier was actually his friend Bucky Barnes who had been brainwashed by HYDRA for decades, following Barnes' apparent death in 1945."
  },
  {
    "name": "Quicksilver",
    "realname": "Pietro Maximoff",
    "team": "Avengers",
    "firstappearance": "1964",
    "createdby": "Stan Lee and Jack Kirby ",
    "publisher": "Marvel Comics",
    "IMDB": "N/A",
    "youtubeURL": "https://www.youtube.com/watch?v=T9GFyZ5LREQ",
    "imageurl": "https://i.pinimg.com/736x/8c/3a/8b/8c3a8b103187094e6e93c601d326abae.jpg",
    "bio": "\n\n\t\tQuicksilver has the superhuman ability to move at great speeds. In most depictions, he is a mutant, a human born with innate superhuman powers. ... He is the twin brother of the Scarlet Witch and, in most depictions, the son of Magneto and the half-brother of Polaris. \n\n Quicksilver (Pietro Maximoff) is a mutant with the ability to think and move at superhuman speeds, and has enhanced agility and reflexes. He is able to run beyond speed of light, accomplishes feats such as creating cyclones out of pure speed, running up walls and above bodies of water. \n\n Pietro and his twin sister, Wanda always assumed that they were the children of the gypsy couple that raised them, Django and Marya Maximoff. They did not know that they had been adopted. In fact, they were born on Wundergore Mountain to a woman only known as Magda, a woman on the run from her husband who had “become a monster”. She appeared at the house of Bova, the midwife to the High Evolutionary, heavily pregnant and stayed for a few weeks until she gave birth. She then immediately fled into a raging blizzard and was never seen or heard from again. Given her weakened state following delivery, it is assumed that she perished. While at Wundagore Mountain, they were also offered for adoption to the Whizzer when his wife died. He did not accept them, but thought that they were his children. Poor but loved, the twins enjoyed a relatively happy childhood until their family was killed by local villagers angered at Django for stealing food. Using his new found powers, Pietro was able to rescue Wanda. Orphaned, the twins wandered Eastern Europe, constantly on the move as Wanda’s uncontrollable hex powers would draw suspicion from the people around them. One day Wanda accidentally set a house on fire, spurring the locals to attack the twins. Despite his best efforts, Wanda and Pietro were trapped until rescued by Magneto. Feeling that they owed him a debt, they reluctantly joined the Brotherhood Of Evil Mutants. Magneto playders and Wanda’s gratitude, but neither twin was comfortable as a terrorist. Pietro always made his disapproval known and repeatedly stated that he stayed only for his sister’s sake. Wanda was more compliant, feeling indebted to Magneto, but was deeply unhappy and often shocked by Magneto’s callous behavior. Whilst in the Brotherhood of Evil Mutants, both Toad and Mastermind would often play for Scarlet Witch's feelings, and so Quicksilver would stand between her and them. Unconsciously, however, both twins absorbed Magneto’s attitude of mutant superiority, which would occasionally surface from time to time in their lives. When Magneto was taken from Earth by the Stranger, Pietro and Wanda ended their association with the Brotherhood and returned to Europe. \n\n <b>New Beginnings</b> \n\n When they heard that the Avengers were accepting applicants, they rushed to join, wanting to atone for their past crimes. Quicksilver and the Scarlet Witch served honorably with the Avengers for years, though Pietro’s arrogant and distrupting demeanor often made him an outsider in the group. He would often clash with Hawkeye over which one of them should replace Captain America as a leader. Quicksilver and Scarlet Witch had to leave the Avengers for a while when they lost their powers, and they subsequently returned to their birthplace. Whilst at Wundagore Mountain, they were telepathically asked by Professor X to join the X-Men so that they could help them fight against Factor Three, but the two mutants declared that if they should return to America, it would be as Avengers. Upon their return, Quicksilver's powers had somehow increased, as he could now fly for short distances by vibrating his feet at high speeds. Shortly after their return, Quicksilver willingly joined the Brotherhood of Evil Mutants after Scarlet Witch was hit by a bullet, shot by a mere human. Unknown to Pietro and Wanda, the bullet was being controlled by Magneto. Eventually he calmed down and left the Brotherhood, but instead of rejoining the Avengers Quicksilver, Wanda and Toad became travelling companions for a while. Since the bullet had erased Wanda's power somehow, the three companions went to Europe, and found a book of spells which they believed could restore Wanda's powers. Instead, the spell summoned Arkon, who wished for Wanda to be his bride. With the help of the Avengers, Wanda was saved, and as her powers had been restored by the dimensional jump between Earth and Arkon's planet, the twins rejoined the Avengers. During this stint with the Avengers, Pietro played a role in the Kree/Skrull War, as help against Ares. When Wanda fell in love with the android Vision, Pietro protested loudly, refusing to attend their wedding. In the interim, Pietro pursued a romantic relationship of his own. After battling Sentinels, Quicksilver was gravely wounded. He was nursed back to health by Crystal, one of the Inhumans. He fell deeply in love with her and the two got married. During the Korvac saga, Pietro still protested against Wanda's marriage until Moondragon telepathically erased Pietro’s prejudice against the android that loved his sister, causing him to accept the relationship. In an encounter with Django Maximoff, he revealed that Pietro and Wanda were adopted. They traveled to Wundegore Mountain to search for their roots. To their surprise they found Bova, who told them about their birth mother. Their father’s identity, however, remained a mystery, for Magda was obviously terrified of him, and had never spoken his name. Pietro left the Avengers to live with his wife’s family on the moon in the Inhuman city of Attilan. He served as an officer in their militia. Crystal and Pietro soon had a daughter, Luna, who turned out to be a normal human child. While the Scarlet Witch and the Vision were visiting the happy family on Attilan shortly after Luna’s birth, Magneto arrived. Turned from his path of terrorism, he too had been on a quest of his past trying to retrace the last steps of his missing wife. Thinking him nothing more than an innocent traveller, Bova had also told Magneto Magda’s story and unwittingly informed him that he was the father of the very youths he had manipulated and browbeaten in the Brotherhood. He had immediately rushed to Attilan to inform the twins who were shocked. While Wanda was confused and unsure, Pietro was appalled. He rejected Magneto outright. While Magneto was in his reform period, he earned Pietro’s tentative respect, but not his acceptance. When Magneto returned to terrorism, Pietro hated him all the more."
  },
  {
    "name": "Daredevil",
    "realname": "Matthew Murdock",
    "team": "Avengers",
    "firstappearance": "1964",
    "createdby": "Stan Lee and Bill Everett",
    "publisher": "Marvel Comics",
    "IMDB": "8.6/10",
    "youtubeURL": "https://www.youtube.com/watch?v=e0dDxVAO8K0",
    "imageurl": "https://static.wikia.nocookie.net/marveldatabase/images/a/aa/Daredevil_Vol_6_21_Textless.jpg/revision/latest?cb=20200221001243",
    "bio": "\n\n\t\t Blinded as a child in an accident that left his other senses enhanced to extraordinary levels, Matt Murdock fights relentlessly for the law and for justice, both as a crusading attorney and as the hard-hitting costumed crimefighter called Daredevil. \n\n <b>His Father’s Son</b> \n\n Matt Murdock grew up as the son of boxer “Battlin’ Jack” Murdock in the Hell’s Kitchen neighborhood of New York City. Matt’s mother left them when he was quite young, and his father told him that she had died. As Jack aged, he was forced to take work from a local criminal known as the Fixer (Roscoe Sweeny), who eventually coerced the pugilist to work as his enforcer. \n\n While Matt was a natural athlete, Jack sought to keep him out of his world of violence, hoping that the boy could get an education and escape Hell’s Kitchen. Jack made Matt promise him that he would study hard and never use his fists. The young Murdock’s commitment to his studies made him a target of bullies, who nicknamed him “Daredevil” when he wouldn’t fight back. Matt worked out his frustrations at the gym. \n\n Matt’s life was changed forever when he saw an out-of-control truck speeding toward a blind old man crossing the street. Matt pushed the bystander out of the path of the vehicle, which had been carrying radioactive materials. A container fell off the vehicle and broke open, spilling a radioactive liquid into Matt’s eyes. The incident left the boy blind, but all his remaining senses were enhanced significantly. Soon after, he met Stick, a blind martial-arts master, under whose harsh tutelage Matt came to understand his newly developed senses and blossomed into a formidable fighter. \n\n As a college student, Matt attended a boxing match in which his father would be fighting. The past his prime Jack Murdock had been ordered by the Fixer to throw the bout. Not wanting to lose in front of his son, Jack failed to take a dive and won the match. Later that night, a group of the Fixer’s underlings ambushed Jack in an alley and killed him. \n\n Devastated by his father’s death, Matt was enraged when the legal system failed to bring the Fixer to justice. Murdock graduated summa cum laude from Harvard Law School as class valedictorian, but also decided to go after the Fixer on his own. Creating a costume that hid his real identity, Matt used the childhood nickname that was meant to mock him as the basis for his new alter ego. As the vigilante Daredevil, Matt hunted down the members of the Fixer’s gang, then pursued the mastermind himself. The terrified criminal died of a heart attack—and Matt realized he had found his second purpose in life. \n\n Co-founding a law firm, Matt was determined to serve the legal system as best he could as an attorney—but those the law could not reach would have to face him as Daredevil."
  }
]
