[
  {
    "name": "Captain America",
    "realname": "Steve Rogers",
    "team": "Avengers",
    "firstappearance": "1941",
    "createdby": "Joe Simon",
    "publisher": "Marvel Comics",
    "youtubeURL": "https://www.youtube.com/watch?v=dKrVegVI0Us",
    "IMDB": "6.9/10",
    "imageurl": "https://www.simplifiedcoding.net/demos/marvel/captainamerica.jpg",
    "bio": "Prometendo servir seu país de qualquer maneira que pudesse, o jovem Steve Rogers tomou o soro do super soldado para se tornar o exército de um homem só da América. Lutando pelo vermelho, branco e azul por mais de 60 anos, o Capitão América é o símbolo vivo de liberdade e liberdade."
  },
  {
    "name": "Iron Man",
    "realname": "Tony Stark",
    "team": "Avengers",
    "firstappearance": "1963",
    "createdby": "Stan Lee",
    "publisher": "Marvel Comics",
    "youtubeURL": "https://www.youtube.com/watch?v=5evGlVgmmfM",
    "IMDB": "7.9/10",
    "imageurl": "https://www.simplifiedcoding.net/demos/marvel/ironman.jpg",
    "bio": "Ferido, capturado e forçado a construir uma arma por seus inimigos, o industrial bilionário Tony Stark criou uma armadura avançada para salvar sua vida e escapar do cativeiro. Agora com uma nova visão da vida, Tony usa seu dinheiro e inteligência para tornar o mundo um lugar melhor e mais seguro como o Homem de Ferro."
  },
  {
    "name": "Wolverine",
    "realname": "James Howlett",
    "team": "X-Men",
    "firstappearance": "1974",
    "createdby": "Len Wein",
    "publisher": "Marvel Comics",
    "youtubeURL": "https://www.youtube.com/watch?v=wnww8PunWII",
    "IMDB": "6.7/10",
    "imageurl": "https://www.simplifiedcoding.net/demos/marvel/logan.jpg",
    "bio": "Nascido com sentidos sobre-humanos e o poder de curar quase qualquer ferida, Wolverine foi capturado por uma organização canadense secreta e recebeu um esqueleto inquebrável e garras. Tratado como um animal, levou anos para ele se controlar. Agora, ele é o primeiro membro dos X-Men e dos Vingadores."
  },
  {
    "name": "Spiderman",
    "realname": "Peter Parker",
    "team": "Avengers",
    "firstappearance": "1962",
    "createdby": "Stan Lee",
    "publisher": "Marvel Comics",
    "youtubeURL": "https://www.youtube.com/watch?v=Lxx0JErW4Vc",
    "IMDB": "7.3/10",
    "imageurl": "https://www.simplifiedcoding.net/demos/marvel/spiderman.jpg",
    "bio": "Picado por uma aranha radioativa, o estudante do ensino médio Peter Parker ganhou a velocidade, força e poderes de uma aranha. Adotando o nome de Homem-Aranha, Peter esperava começar uma carreira usando suas novas habilidades. Ensinado que grandes poderes trazem grandes responsabilidades, o Aranha prometeu usar seus poderes para ajudar as pessoas."
  },
  {
    "name": "Thor",
    "realname": "Thor Odinson",
    "team": "Avengers",
    "firstappearance": "1962",
    "createdby": "Stan Lee",
    "publisher": "Marvel Comics",
    "youtubeURL": "https://www.youtube.com/watch?v=JOddp-nlNvQ",
    "IMDB": "7/10",
    "imageurl": "https://www.simplifiedcoding.net/demos/marvel/thor.jpg",
    "bio": "Como o deus nórdico do trovão e do relâmpago, Thor empunha uma das maiores armas já feitas, o martelo encantado Mjolnir. Enquanto outros descreveram Thor como um imbecil excessivamente musculoso e estúpido, ele é bastante inteligente e compassivo. Ele é autoconfiante e nunca, jamais, pararia de lutar por uma causa válida."
  },
  {
    "name": "Hulk",
    "realname": "Robert Bruce Banner",
    "team": "Avengers",
    "firstappearance": "1962",
    "createdby": "Stan Lee",
    "publisher": "Marvel Comics",
    "youtubeURL": "https://www.youtube.com/watch?v=1fAs9WPb2sY",
    "IMDB": "5.6/10",
    "imageurl": "https://www.denofgeek.com/wp-content/uploads/2019/03/incredible-hulk-key-art.jpg?fit=1200%2C675",
    "bio": "Pego em uma explosão de bomba gama enquanto tentava salvar a vida de um adolescente, o Dr. Bruce Banner foi transformado na criatura incrivelmente poderosa chamada Hulk. Um herói frequentemente mal compreendido, quanto mais zangado o Hulk fica, mais forte ele fica."
  },
  {
    "name": "Wanda Maximoff",
    "realname": "Scarlet Witch.",
    "team": "Avengers",
    "firstappearance": "1964",
    "createdby": "Stan Lee",
    "publisher": "Marvel Comics",
    "youtubeURL": "https://www.youtube.com/watch?v=y4oH7qOhWMc",
    "IMDB": "8.1/10",
    "imageurl": "https://nerdist.com/wp-content/uploads/2021/02/Wanda-Maximoff-Civil-War.jpg",
    "bio": "A nativa de Sokov, Wanda Maximoff, e seu irmão gêmeo Pietro sobreviveram a uma explosão em seu prédio que matou os pais. Outro míssil pousou, mas não explodiu. Isso os aterrorizou por dias enquanto permaneciam presos nos escombros, com o dispositivo mortal na frente deles, o nome Stark estampado na lateral. Anos depois, os dois se ofereceram para passar por experimentos genéticos supervisionados por HYDRA's Baron Wolfgang von Strucker, usando o cetro de Loki, para potencialmente dar-lhes poderes. Uma das poucas sobreviventes dos experimentos, junto com seu irmão, Wanda descobriu-se com uma variedade de habilidades. Ao lado de Pietro, Wanda passou a usar essas habilidades para ajudar o robô Ultron, que compartilhava seu desdém por Tony Stark."
  },
  {
    "name": "Thanos",
    "realname": "Josh Brolin Damion Poitier",
    "team": "Avengers",
    "firstappearance": "1973",
    "createdby": "Jim Starlin",
    "publisher": "Marvel Comics",
    "youtubeURL": "https://www.youtube.com/watch?v=osSJhXruEzU",
    "IMDB": "8.3/10",
    "imageurl": "https://i.insider.com/5a1eb89d3339b0962f8b459e",
    "bio": "O Mad Titan Thanos, um indivíduo melancólico e taciturno, consumido pelo conceito de morte, buscou o poder pessoal e aumentou a força, dotando-se de implantes cibernéticos até se tornar mais poderoso do que qualquer um de seus irmãos."
  },
  {
    "name": "Deadpool",
    "realname": "Wade Wilson",
    "team": "X-Force",
    "firstappearance": "1991",
    "createdby": "Fabian Nicieza and Rob Liefeld",
    "publisher": "Marvel Comics",
    "youtubeURL": "https://www.youtube.com/watch?v=Xithigfg7dA",
    "IMDB": "8/10",
    "imageurl": "https://miro.medium.com/max/3840/1*0ubYRV_WNR9iYrzUAVINHw.jpeg",
    "bio": "Bem-vindos à biografia do personagem Deadpool, nerds! Quero dizer ... verdadeiros crentes! Trazido a você por mim, por mim e por mim: o fabuloso Deadpool! Eu poderia ter deixado algum estagiário empurrador de lápis fedorento contar a história de minha vida para você, mas você merece coisa melhor. Então, aqui está, direto do Merc com a boca de uma boca - cada detalhe do meu passado moralmente ambíguo, mentalmente instável e cheio de insinuações. Desde a minha primeira aparição em NEW MUTANTS # 98, ao meu mais recente anti-heróico de tirar o fôlego e alívio cômico, a uma terceira coisa que eu não consigo pensar agora, esta é a história definitiva de Deadpool."
  },
  {
    "name": "Clint Barton",
    "realname": "Jeremy Renner",
    "team": "Avengers",
    "firstappearance": "2011",
    "createdby": "Stan Lee and Don Heck",
    "publisher": "Marvel Comics",
    "youtubeURL": "https://www.youtube.com/watch?v=VM4_X0MVLzY",
    "IMDB": "N/A",
    "imageurl": "https://images.hindustantimes.com/rf/image_size_630x354/HT/p2/2018/09/11/Pictures/null_495f16c2-b5a2-11e8-bbaf-ff4d73ce44e3.jpg",
    "bio": "O homem que se tornaria conhecido como Hawkeye nasceu Clint Barton. Órfão em tenra idade, ele se juntou ao circo e se tornou aprendiz do Espadachim, um artista que se especializou em truques com lâminas. Depois que ele descobriu o Espadachim roubando do circo, os dois lutaram, e Barton foi dado como morto. Barton se recuperou e continuou seu treinamento marcial com o arqueiro residente do circo, Trickshot. Barton se destacou com o arco e decidiu usar suas habilidades para embarcar em uma carreira como um combatente do crime fantasiado chamado Hawkeye."
  },
  {
    "name": "Loki",
    "realname": "Tom Hiddleston",
    "team": "Avengers",
    "firstappearance": "1962",
    "createdby": "Stan Lee, Larry Lieber, penciller Jack Kirby ",
    "youtubeURL": "https://www.youtube.com/watch?v=UlnufxrJlAk",
    "IMDB": "N/A",
    "publisher": "Marvel Comics",
    "imageurl": "https://i.cdn.newsbytesapp.com/images/l205_32701605867168.jpg",
    "bio": "Loki, Príncipe de Asgard, Odinson, herdeiro legítimo de Jotunheim e Deus do Mal, está sobrecarregado com um propósito glorioso. Seu desejo de ser um rei o leva a semear o caos em Asgard. Em sua ânsia de poder, ele estende seu alcance à Terra, onde acredita que eles precisam de um governante e encontra heróis improváveis ​​que interferem em seus planos. Deus da Travessura O sempre intrigante Loki, criado como filho do Rei Odin e da Rainha Frigga de Asgard, está ressentido por viver na sombra de seu irmão Thor. Loki estudou artes mágicas ganhando o título de “Deus do Mal”, enquanto seu irmão perseguia proezas físicas."
  },
  {
    "name": "Black Panther",
    "realname": "T'Challa",
    "team": "Avengers",
    "firstappearance": "1966",
    "createdby": "Stan Lee and Jack Kirby ",
    "publisher": "Marvel Comics",
    "youtubeURL": "https://www.youtube.com/watch?v=xjDjIWPwcPU",
    "IMDB": "7.3/10",
    "imageurl": "https://cms.qz.com/wp-content/uploads/2018/02/black-panther-e1513870292357.jpg?quality=75&strip=all&w=1600&h=900&crop=1",
    "bio": "Um nativo da pequena, mas tecnologicamente avançada nação africana de Wakanda, T'Challa aceitou o manto de Pantera Negra, o lendário protetor do povo Wakandan, de seu pai, o Rei T'Chaka, que desempenhou o papel antes dele como seu pai antes dele e assim por diante."
  },
  {
    "name": "Jean Grey",
    "realname": "Jean Elaine Grey",
    "team": "Avengers",
    "firstappearance": "1963",
    "createdby": "Stan Lee and Jack Kirby ",
    "publisher": "Marvel Comics",
    "youtubeURL": "https://www.youtube.com/watch?v=azvR__GRQic",
    "IMDB": "5.7/10",
    "imageurl": "https://img.cinemablend.com/filter:scale/quill/1/6/0/d/2/f/160d2fecd5a21712d1336b6f11734abbfa9ed556.jpg?fw=1200",
    "bio": "A filha mais nova do professor de história John Gray e sua esposa Elaine, Jean Gray tinha 10 anos quando seus poderes telepáticos mutantes se manifestaram pela primeira vez depois de experimentar as emoções de um amigo moribundo."
  },
  {
    "name": "Nick Fury",
    "realname": "Colonel Nicholas",
    "team": "Avengers",
    "firstappearance": "1963",
    "createdby": "Stan Lee and Jack Kirby ",
    "publisher": "Marvel Comics",
    "youtubeURL": "https://www.youtube.com/watch?v=Jef6OEBXl7w",
    "IMDB": "N/A",
    "imageurl": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/18/25/1529317045-nick-fury-samuel-l-jackson-mcu.jpg",
    "bio": "Nicholas Joseph Nick Fury é um espião de renome mundial, ex-Diretor da S.H.I.E.L.D. e fundador dos Vingadores. Fury começou sua carreira no Exército dos Estados Unidos no final dos anos 1960, chegando ao posto de Coronel antes de sua dispensa honrosa."
  },
  {
    "name": "Quicksilver",
    "realname": "Pietro Maximoff",
    "team": "Avengers",
    "firstappearance": "1964",
    "createdby": "Stan Lee and Jack Kirby ",
    "publisher": "Marvel Comics",
    "IMDB": "N/A",
    "youtubeURL": "https://www.youtube.com/watch?v=T9GFyZ5LREQ",
    "imageurl": "https://i.pinimg.com/736x/8c/3a/8b/8c3a8b103187094e6e93c601d326abae.jpg",
    "bio": "Quicksilver tem a habilidade sobre-humana de se mover a grandes velocidades. Na maioria das representações, ele é um mutante, um ser humano nascido com poderes sobre-humanos inatos. ... Ele é o irmão gêmeo da Bruxa Escarlate e, na maioria das representações, o filho de Magneto e o meio-irmão de Polaris."
  },
  {
    "name": "Daredevil",
    "realname": "Matthew Murdock",
    "team": "Avengers",
    "firstappearance": "1964",
    "createdby": "Stan Lee and Bill Everett",
    "publisher": "Marvel Comics",
    "IMDB": "8.6/10",
    "youtubeURL": "https://www.youtube.com/watch?v=e0dDxVAO8K0",
    "imageurl": "https://static.wikia.nocookie.net/marveldatabase/images/a/aa/Daredevil_Vol_6_21_Textless.jpg/revision/latest?cb=20200221001243",
    "bio": "Cego quando criança em um acidente que deixou seus outros sentidos aprimorados a níveis extraordinários, Matt Murdock luta incansavelmente pela lei e pela justiça, tanto como advogado cruzado quanto como o contundente criminoso fantasiado chamado Demolidor."
  }
]
